"""
-------------------------------------正则表达式入门---------------------------------

1.正则表达式是一种用于描述字符串模式的模式语言。它提供了一种简单而强大的方式来
匹配字符串的模式，包括搜索、替换、验证等操作。

2.正则表达式是一种由特定语法规则组成的文本模式，用来描述，匹配字符中符合特定规则的序列。就相当于一种模式匹配工具
  ，允许用户通过简洁的语法进行复杂的文本搜索，匹配，提取和替换操作。

3.例如
  1[3-9]\d{9}

  1: 文本开头必须是1
  [3-9]: 第二位必须是3-9之间的数字
  \d{9}: 后面必须是9位数字



4.常用的正则操作方法:
  match() - 从字符串的开头开始匹配（返回Match对象）若开头不符合，则匹配失败返回None并报错
  search() - 从任意位置开始，搜索第一个匹配项（返回Match对象）
  findall() - 从任意位置开始，搜索所有匹配项（返回List）

  返回结果.group() - 返回匹配项的字符串
  返回结果.span() - 返回匹配项的索引范围（start, end）

5.字符串前的r表示原始字符串，用于避免转义字符的干扰。



"""

import re

s = "我的手机号是18809091231你记住了吗？我的另一个手机号是188000017665777093，QQ号是1779989922你记住了吗？"

# # match - 从字符串的开头开始匹配，若开头不符合，则匹配失败返回None并报错,否则返回Match对象
# result = re.match(r"1[3-9]\d{9}", s)
# print(result.group())
# print(result.span())

# search - 从任意位置开始，搜索第一个匹配项（返回Match对象）
result = re.search(r"1[3-9]\d{9}", s)
print(result.group())
print(result.span())

# findall - 从任意位置开始，搜索所有匹配项（返回List）
result = re.findall(r"1[3-9]\d{9}", s)
print(result)

