"""
---------------------------------正则表达式-语法---------------------------------

正则表达式的写法多种多样，具体的语法如下：

字符匹配相关:
普通字符    字母、数字、汉字及大多数字符，直接匹配自身
.           匹配任意一个字符（除\n）
\d          匹配数字 0-9
\D          匹配非数字
\w          匹配单词字符，即a-z、A-Z、0-9、_、其他语言字符
\W          匹配非单词字符
[aeiou]     匹配其中的任何单个字符
[^aeiou]    求反，匹配不在字符列表中的任何单个字符
[0-5]       表示范围

量词与结构:
*           出现任意次（0次或无数次）
+           至少出现1次（1次或无数次）
?           至多出现一次（0次或1次）
{m}         出现m次
{m,}        至少出现m次
{m,n}       出现m到n次
|           或的意思，匹配左右任意一个表达式
()          分组，将括号里的多个字符视为一个单元
^           匹配字符串开头
$           匹配字符串结尾

"""