# #输入与输出---input()--获取用户输入的内容
# #输出与输出---print()
# name = input("请输入您的用户名：")
# key = input("请输入您的密码：")
# print(f"欢迎{name}登录，愿您使用愉快！")
# print("欢迎%s登录，愿您使用愉快！" % name)

# #案例：ATM机取款
# # 1.输入用户姓名
# name = input("请输入年的用户名：")
# # 2.输入用户密码
# key = input("请输入您的密码：")
# # 3.输入取款金额
# sum = float(input("请输入取款金额："))
# # 4.判断取款金额是否大于余额
# ss = 100000
# if sum > ss:
#     print("取款金额不能大于余额")
# # 5.判断余额是否大于等于取款金额，若大于等于取款金额，取款成功，否则余额不足
# if sum <= ss:
#     ss -= sum
#     print(f"您已成功取出{sum}元，您的当前余额为：{ss}")
# else:
#     print("余额不足")





# 算数标识符的优先级 --> ** --> * / //  % --> + -
# 