"""
----------------------------------文件操作入门---------------------------------

1.日常我们操作文件时，基本分为三步：打开，读/写，关闭文件。
文件基本操作：
    1.1 打开文件
    f = open("文件路径","文件模式","编码方式")
    # 文件模式：    
         r只读
         w写入(若文件不存在，则创建新文件，若文件存在，则清空文件内容覆盖重写) 
         a追加(若文件不存在，则创建新文件，若文件存在，则在文件末尾追加内容)

    # 文件路径：文件的绝对路径或相对路径
    # 编码方式：utf-8 gbk等

    1.2 读取文件内容
    content = f.read()
    # 读取文件的所有内容
    # 可以使用readlines()方法读取文件的每一行
    lines = f.readlines()
    # 读取文件的每一行，返回一个列表，每个元素是一个字符串，字符串包含该行的内容
    # 可以使用for循环遍历列表，打印每一行的内容
    for line in lines:
        print(line)

    1.3 写入文件内容
    f.write("这是写入的内容")
    # 可以使用write()方法写入文件的内容
    # 可以使用write()方法写入文件的内容
    # 可以使用write()方法写入文件的内容

    1.4 关闭文件
    f.close()
"""

# # 案例
# # 读文件
# # 打开文件
# f = open("第三章/resources/望庐山瀑布.txt","r",encoding="utf-8")
# # 读取内容
# # content = f.read()
# # print(content)

# content_list = f.readlines()
# print(content_list)
# # 遍历列表，打印每一行的内容
# for line in content_list:
#     print(line,end="")
# # 关闭文件
# f.close()


# # 写入
# # 打开文件
# f = open("第三章/resources/静夜思.txt","w",encoding="utf-8")
# # 写入内容
# f.write("静夜思(唐.李白)\n\n")
# f.write("床前明月光，疑是地上霜。\n")
# f.write("举头望明月，低头思故乡。")
# # 关闭文件
# f.close()

"""
----------------------------------文件操作(资源释放)---------------------------------

1. 关闭文件(文件运行正常情况下)--在上一节操作完成后，及时关闭文件，释放资源
    f.close()
2.如果文件运行异常，需要在finally语句中关闭文件，释放资源
    try:
        # 打开文件
        f = open("文件路径","文件模式","编码方式")
        # 读取文件内容
        content = f.read()
    except:
        # 处理异常
        pass
    finally:
        # 关闭文件
        f.close()

3.with语句(上下文管理器)：核心作用就是确保资源总是被正确的获取与释放(即使发生异常，也会自动关闭文件)
    项目中推荐的方式
    with open("文件路径","文件模式","编码方式") as f:
        # 读取文件内容
        content = f.read()
        # 处理文件内容
        print(content)
        # 关闭文件
        f.close()
"""
