"""
-----------------------------streamlit入门-------------------------

1.streamlit 是专门为(数据科学与机器学习领域)工程师快速设计web页面提供的第三方库

2.过于复杂的电商页面不行，需要专业的前端开发知识。
"""
# 导入库
import streamlit as st

# 设置页面的配置
st.set_page_config(
    page_title="Ex-stream-ly Cool App",
    page_icon="🧊",
    # 布局
    layout="wide",
    # 控制侧边栏的状态
    initial_sidebar_state="expanded",
    menu_items={
        'Get Help': 'https://www.extremelycoolapp.com/help',
        'Report a bug': "https://www.extremelycoolapp.com/bug",
        'About': "# 这是一个streamlit的入门程序"
    }
)

# """
# ------------------------------streamlit常用功能组件---------------------------
# """
# logo
st.logo("resources/无职转生logo.png")
# 标题测试
st.title("streamlit 入门程序")
st.header("streamlit 一级标题")
st.subheader("streamlit 二级标题")

# 段落文字
st.write("洛琪希・米格路迪亚・格雷拉特，是《无职转生～到了异世界就拿出真本事～》的主要角色之一，属于魔族米格路德族。米格路德族依靠心电感应交流，可洛琪希天生无法使用念话，只能开口说话，在同族之中被视作异类。她的故乡是魔大陆深处的米格路德村落，族群封闭保守，排斥异类，难以接纳向往外部世界的她。无法融入族群的洛琪希最终告别故土，独自踏上旅途，去大陆各地游历、钻研魔法。")
st.write("洛琪希的性格是矛盾而立体的。她外表看着文静，略带冒失，内心却藏着很深的自卑，这源于长久以来被同族孤立的经历。但自卑之下，她又有着极强的韧性与温柔。遇到鲁迪乌斯之前，她身为天才魔法师，带着一点自负；在见识鲁迪乌斯惊人的魔法天赋之后，她学会放下骄傲，变得谦逊。她很善于体察他人的情绪，富有同理心，愿意耐心开导内心封闭的鲁迪乌斯，是照亮鲁迪童年的重要之人。不过她内心敏感，很害怕被身边的人讨厌，偶尔会胡思乱想。")
st.write("她最大的爱好就是钻研魔法，不断练习缩短咏唱时间，尝试挑战更高阶的法术。只要遇到新奇的魔术理论，她就会投入大量时间去试验。闲暇时她也喜欢阅读魔法典籍，游历各地迷宫，在冒险中积累实战经验。她不喜欢别人单凭娇小的外貌把她当成小孩子，也讨厌他人因为魔族身份而歧视自己。冒险路上，她享受探索未知的新鲜感，但也畏惧孤独，一直期盼着能找到一处可以安心停靠的归宿。")
st.write("洛琪希是水王级魔术师，A 级冒险者，招牌法术便是水圣级魔术豪雷积雨云。火属性达到圣级，风、土魔法掌握上级，同时会中级治疗魔法与初级解毒魔法。她的短板是魔力总量不算多，释放豪雷积雨云这样的大招之后，魔力会迅速枯竭。但她战斗思路冷静，擅长活用魔法、预判对手行动，精通近距离魔术战法，弥补魔力上的不足。她曾经独自攻略迷宫，也在多次险境之中凭借魔法与临场决断活下来，论综合实战能力，在大陆的魔法师里属于第一梯队。")
# 图片
st.image("resources/无职转生洛琪希.png")
# 音频
st.audio("resources/无职转生洛琪希相关内容生成.mp3")
# 视频
st.video("resources/暴风雨.mp4")
# 表格
st.write("其他角色介绍")
ch = {
    "角色":["鲁迪乌斯", "洛琪希", "艾莉丝", "希露菲"],
    "介绍":["主角，前世被卡车撞死后转生到异世界，从小苦练魔法","水王级魔术师，主角的师父，认真又怕孤单","主角的青梅竹马，脾气火爆的剑术天才","主角的青梅竹马，温柔内向，擅长治愈魔法"],
    "实力":["魔力总量巨大，魔法全能","水王级，招牌法术豪雷积雨云","A级冒险者，剑术高超","天赋高，善用治愈魔法"]
}
st.table(ch)
# 输入框
name = st.text_input("请输入你的名字")
st.write(f"你的名字为：{name}")

pd = st.text_input("请输入你的密码",type="password")
st.write(f"你的密码为：{pd}")

# 复选框
gender = st.radio("请输入您的性别",["男","女","未知"],index=2)
st.write(f"你的性别为：{gender}")