"""
-------------------------------深入理解asynic-------------------------------


￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥
1. 在 Python 中，async def 关键字主要用于定义（异步函数/协程函数），这种函数可以执行非阻塞操作
   （通过 await 实现），并允许在等待某些任务完成时，程序继续执行其他任务。

   协程函数/异步函数：
   协程函数/异步函数  是一种特殊的函数，它可以在执行过程中挂起，等其他任务完成后再恢复执行。
   协程函数/异步函数的返回值  是一个协程对象，而不是直接的结果。

   协程对象：是是一个未开始执行的任务。要执行这个任务，必须通过事件循环来调度。

   只有创建事件循环，并把（异步/协程函数）返回的协程对象注册到事件循环并运行才能拿到函数的返回值
   代码：
        coro = asyncio.run(coro)  # 创建事件循环，并运行协程对象才能拿到异步/协程函数结果。

￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥￥

"""
import asyncio

async def task():
    print('task')

def demo():
    coro = task()  # core执行结果是协程对象，欣慰task()函数被async def定义了，是异步/协程函数
    # <class 'coroutine'>
    coro = asyncio.run(coro)  # 创建事件循环，并运行协程对象才能拿到异步/协程函数结果。
    print(coro)

if __name__ == '__main__':
    demo()

# 关于这段代码，有以下几个重要点需要理解：
# 协程函数的返回值不是直接的结果，而是一个 协程对象。
# 协程对象 是是一个未开始执行的任务。要执行这个任务，必须通过事件循环来调度。