--DML介绍：用来对数据库中表的数据记录进行增删改查操作
    关键字：INSERT（插入）、DELETE（删除）、UPDATE（更新/修改）

--添加数据：
    -- 1.给指定字段添加数据 语法：
    INSERT INTO 表名(字段1,字段2,字段3...) VALUES(值1,值2,值3...);
    -- 2.给所有字段添加数据 语法：
    INSERT INTO 表名 VALUES(值1,值2,值3...);
    -- 3.为表中一次性添加多条数据 语法：  values后面每个括号代表一条完整数据。
    INSERT INTO 表名(字段1,字段2,字段3...) VALUES(值1,值2,值3...),(值1,值2,值3...);...
    -- 注意：
        1.字段名和值的顺序必须一致
        2.如果字段中包含主键，必须给主键赋值
        3.如果字段中包含自增字段，不能给自增字段赋值
        4.如果字段中包含外键，必须给外键赋值
        5.字符串和日期类型的数据，必须用单引号括起来

--修改数据：
    -- 语法：
    UPDATE 表名 SET 字段1=值1,字段2=值2... WHERE 条件;
    -- 注意：如果没有指定条件，默认修改所有数据

--删除数据：
    -- 语法：
    DELETE FROM 表名 WHERE 条件;
    -- 注意：如果没有指定条件，默认删除所有数据
        
