-- DQL语句：用来查询数据库中表的数据记录
    关键字：
    select + 字段列表
    from 表名
    where 条件;
    group by 字段列表;
    order by 排序字段列表;
    having 分组后条件列表
    limit 分页参数

-- 基本查询：
    -- 语法：
    select 字段列表 from 表名 where 条件;
    -- 字段列表： 字段名1 as 别名1,字段名2 as 别名2,字段名3...(其别名可选)
    -- 全部查询：
    select * from 表名 where 条件;
    -- 去除重复数据：
    select distinct 字段列表 from 表名 where 条件;

-- 条件查询：
    -- 语法：
    select 字段列表 from 表名 where 条件;
    -- 条件： 逻辑运算符(AND,OR,NOT) + 关系运算符(=,>,<,>=,<=) + 字段名 + 值
             占位符  like '%'  表示匹配任意多个字符
             占位符  like '_'  表示匹配任意一个字符
             between  值1 and 值2  表示在两个值之间，包含这两个值

-- 分组查询：
    -- 聚合函数： 用来对多个数据（同一个字段的多个值）进行进行统计分析的函数
    -- 常用的聚合函数有：6个
    -- count()  统计非空值的数量个数
    -- sum()  绱计非空值的总和
    -- avg()  绱计非空值的平均值
    -- max()  统计非空值的最大值
    -- min()  统计非空值的最小值
    -- count(distinct 字段名)  统计非空值的数量个数(去重)

    -- 聚合查询语法：
    select 聚合函数(字段名) as 别名 from 表名 where 条件;

    -- 分组查询语法：
    select 字段列表 from 表名 where 条件 group by 分组字段名 having 分组后过滤条件;
        -- 注意：
               where 用来过滤数据，对分组前的记录进行进行过滤，where 后的条件是不能包含聚合函数的
               having 分组后过滤条件，对分组后的记录进行过滤，having 后的条件是能包含聚合函数的

-- 排序查询：
    -- 语法：
    select 字段列表 from 表名 where 条件 order by 排序字段列表(asc|desc);
    -- 注意：
        -- 排序字段列表： 字段名1,字段名2,字段名3...(每一个字段名后面可以跟asc或desc)
        -- asc 表示升序，desc 表示降序  
        -- 如果是多字段排序，当第一个字段的值相同时，再根据第二个字段的值进行排序
        -- 如果第二个字段的值也相同时，再根据第三个字段的值进行排序，以此类推

-- 分页查询：
    -- 语法：
    select 字段列表 from 表名 where 条件 order by 排序字段列表(asc|desc) limit 偏移量,每页条数;
    -- 注意：
        -- 偏移量： 从第几条记录开始查询，默认是0
        -- 每页条数： 每页查询的记录数，默认是10    
    